---
type: CancellationListener
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# CancellationListener

`Autodesk.Revit.DB.CancellationListener` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsCancelled | 2017 | `public bool IsCancelled ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |